interfaces/gcc_perf.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>gcc Perf Stat</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../interfaces.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">gcc Perf Stat</h1>
<div id="outline-container-org4ab1fe9" class="outline-2">
<h2 id="org4ab1fe9">Function Overloading</h2>
<div class="outline-text-2" id="text-org4ab1fe9">
<div class="org-src-container">
<pre class="src src-shell">Rendering took <span style="color: #da8548; font-weight: bold;">43.784233</span> seconds

 Performance counter stats for <span style="color: #98be65;">'taskset -c 0 bin/macros 25000 25000 45'</span>:

         43,774.72 msec task-clock                       <span style="color: #5B6268;">#    </span><span style="color: #5B6268;">1.000 CPUs utilized</span>
               <span style="color: #da8548; font-weight: bold;">972</span>      context-switches                 <span style="color: #5B6268;">#   </span><span style="color: #5B6268;">22.205 /sec</span>
                <span style="color: #da8548; font-weight: bold;">98</span>      page-faults                      <span style="color: #5B6268;">#    </span><span style="color: #5B6268;">2.239 /sec</span>
         2,688,191      cpu_atom/cache-references/       <span style="color: #5B6268;">#   </span><span style="color: #5B6268;">61.410 K/sec</span>
           362,933      cpu_atom/cache-misses/           <span style="color: #5B6268;">#   </span><span style="color: #5B6268;">13.50% of all cache refs</span>
   187,633,104,182      cpu_atom/cycles/                 <span style="color: #5B6268;">#    </span><span style="color: #5B6268;">4.286 GHz</span>
   890,959,058,925      cpu_atom/instructions/           <span style="color: #5B6268;">#    </span><span style="color: #5B6268;">4.75  insn per cycle</span>
   172,137,199,972      cpu_atom/branches/               <span style="color: #5B6268;">#    </span><span style="color: #5B6268;">3.932 G/sec</span>
         6,891,780      cpu_atom/branch-misses/          <span style="color: #5B6268;">#    </span><span style="color: #5B6268;">0.00% of all branches</span>

      <span style="color: #da8548; font-weight: bold;">43.785564305</span> seconds time elapsed

      <span style="color: #da8548; font-weight: bold;">43.637340000</span> seconds user
       <span style="color: #da8548; font-weight: bold;">0.101883000</span> seconds sys
</pre>
</div>
</div>
</div>
<div id="outline-container-org2cf0d1b" class="outline-2">
<h2 id="org2cf0d1b">Tagged Unions</h2>
<div class="outline-text-2" id="text-org2cf0d1b">
<div class="org-src-container">
<pre class="src src-shell">Rendering took <span style="color: #da8548; font-weight: bold;">47.901290</span> seconds

 Performance counter stats for <span style="color: #98be65;">'taskset -c 0 bin/tagged_unions 25000 25000 45'</span>:

         47,889.49 msec task-clock                       <span style="color: #5B6268;">#    </span><span style="color: #5B6268;">1.000 CPUs utilized</span>
             1,173      context-switches                 <span style="color: #5B6268;">#   </span><span style="color: #5B6268;">24.494 /sec</span>
                <span style="color: #da8548; font-weight: bold;">97</span>      page-faults                      <span style="color: #5B6268;">#    </span><span style="color: #5B6268;">2.025 /sec</span>
         3,360,225      cpu_atom/cache-references/       <span style="color: #5B6268;">#   </span><span style="color: #5B6268;">70.166 K/sec</span>
           476,362      cpu_atom/cache-misses/           <span style="color: #5B6268;">#   </span><span style="color: #5B6268;">14.18% of all cache refs</span>
   204,946,307,958      cpu_atom/cycles/                 <span style="color: #5B6268;">#    </span><span style="color: #5B6268;">4.280 GHz</span>
   973,953,630,753      cpu_atom/instructions/           <span style="color: #5B6268;">#    </span><span style="color: #5B6268;">4.75  insn per cycle</span>
   187,018,623,518      cpu_atom/branches/               <span style="color: #5B6268;">#    </span><span style="color: #5B6268;">3.905 G/sec</span>
         7,600,220      cpu_atom/branch-misses/          <span style="color: #5B6268;">#    </span><span style="color: #5B6268;">0.00% of all branches</span>

      <span style="color: #da8548; font-weight: bold;">47.902006942</span> seconds time elapsed

      <span style="color: #da8548; font-weight: bold;">47.757205000</span> seconds user
       <span style="color: #da8548; font-weight: bold;">0.092881000</span> seconds sys
</pre>
</div>
</div>
</div>
<div id="outline-container-org6143c83" class="outline-2">
<h2 id="org6143c83">Function Pointers</h2>
<div class="outline-text-2" id="text-org6143c83">
<div class="org-src-container">
<pre class="src src-shell">Rendering took <span style="color: #da8548; font-weight: bold;">55.646807</span> seconds

 Performance counter stats for <span style="color: #98be65;">'taskset -c 0 bin/function_pointers 25000 25000 45'</span>:

         55,633.32 msec task-clock                       <span style="color: #5B6268;">#    </span><span style="color: #5B6268;">1.000 CPUs utilized</span>
             1,283      context-switches                 <span style="color: #5B6268;">#   </span><span style="color: #5B6268;">23.062 /sec</span>
                <span style="color: #da8548; font-weight: bold;">97</span>      page-faults                      <span style="color: #5B6268;">#    </span><span style="color: #5B6268;">1.744 /sec</span>
         3,653,529      cpu_atom/cache-references/       <span style="color: #5B6268;">#   </span><span style="color: #5B6268;">65.672 K/sec</span>
           525,477      cpu_atom/cache-misses/           <span style="color: #5B6268;">#   </span><span style="color: #5B6268;">14.38% of all cache refs</span>
   237,988,899,252      cpu_atom/cycles/                 <span style="color: #5B6268;">#    </span><span style="color: #5B6268;">4.278 GHz</span>
 1,181,956,477,882      cpu_atom/instructions/           <span style="color: #5B6268;">#    </span><span style="color: #5B6268;">4.97  insn per cycle</span>
   205,760,708,564      cpu_atom/branches/               <span style="color: #5B6268;">#    </span><span style="color: #5B6268;">3.699 G/sec</span>
         7,655,107      cpu_atom/branch-misses/          <span style="color: #5B6268;">#    </span><span style="color: #5B6268;">0.00% of all branches</span>

      <span style="color: #da8548; font-weight: bold;">55.647428786</span> seconds time elapsed

      <span style="color: #da8548; font-weight: bold;">55.502795000</span> seconds user
       <span style="color: #da8548; font-weight: bold;">0.084895000</span> seconds sys
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaed5d8e" class="outline-2">
<h2 id="orgaed5d8e">Full Interface w/ <code>vtable</code></h2>
<div class="outline-text-2" id="text-orgaed5d8e">
<div class="org-src-container">
<pre class="src src-shell">Rendering took <span style="color: #da8548; font-weight: bold;">55.199899</span> seconds

 Performance counter stats for <span style="color: #98be65;">'taskset -c 0 bin/full_interface 25000 25000 45'</span>:

         55,186.51 msec task-clock                       <span style="color: #5B6268;">#    </span><span style="color: #5B6268;">1.000 CPUs utilized</span>
             1,235      context-switches                 <span style="color: #5B6268;">#   </span><span style="color: #5B6268;">22.379 /sec</span>
                <span style="color: #da8548; font-weight: bold;">95</span>      page-faults                      <span style="color: #5B6268;">#    </span><span style="color: #5B6268;">1.721 /sec</span>
         3,596,495      cpu_atom/cache-references/       <span style="color: #5B6268;">#   </span><span style="color: #5B6268;">65.170 K/sec</span>
           473,157      cpu_atom/cache-misses/           <span style="color: #5B6268;">#   </span><span style="color: #5B6268;">13.16% of all cache refs</span>
   236,776,272,463      cpu_atom/cycles/                 <span style="color: #5B6268;">#    </span><span style="color: #5B6268;">4.290 GHz</span>
 1,193,675,214,159      cpu_atom/instructions/           <span style="color: #5B6268;">#    </span><span style="color: #5B6268;">5.04  insn per cycle</span>
   205,760,268,301      cpu_atom/branches/               <span style="color: #5B6268;">#    </span><span style="color: #5B6268;">3.728 G/sec</span>
         7,782,264      cpu_atom/branch-misses/          <span style="color: #5B6268;">#    </span><span style="color: #5B6268;">0.00% of all branches</span>

      <span style="color: #da8548; font-weight: bold;">55.200546439</span> seconds time elapsed

      <span style="color: #da8548; font-weight: bold;">55.034452000</span> seconds user
       <span style="color: #da8548; font-weight: bold;">0.106868000</span> seconds sys
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
